title: EICAR Test File Detection
id: 5863accd-23fa-4d8d-8228-571824816c46
description: Detects quarantine of EICAR test file
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    yara_hit: "EICAR_Test_File"
  condition: selection
fields:
  - quarantined_file
falsepositives:
  - Intentional test submissions
level: low
