title: Executable File Detection
id: b0dc642e-4063-4d2e-ad69-f3f022722184
description: Detects PE files in emails
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    - '*Threats: Detect_PE_File*'
  condition: selection
fields:
  - quarantined_file
falsepositives:
  - Legitimate executable attachments in controlled environments
level: high