title: Gift Card Scam Attempt
id: 39ee0024-a94b-48f9-9c52-a727201f78ae
status: experimental
description: Detects gift card scam emails
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    - '*Threats: Gift_Card_Scam*'
  condition: selection
fields:
  - quarantined_file
  - detected_threats
falsepositives:
  - Legitimate gift card promotions
level: medium