title: Malicious JavaScript Attachment
id: c5ab2014-68cd-4a9c-9c92-24800af1817f
status: experimental
description: Detects emails with JS malware attachments
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    - '*Threats: JS_Malware_Trigger*'
  condition: selection
fields:
  - quarantined_file
  - detected_threats
falsepositives:
  - Legitimate JavaScript attachments in business communications
level: high 