title: Password Hint in Emails
id: 34f28f0c-f125-4f6c-8519-d525ef940376
status: experimental
description: Detects emails containing password hints
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    - '*Threats: Password_Hint_Detected*'
  condition: selection
fields:
  - quarantined_file
  - detected_threats
falsepositives:
  - Legitimate password reset communications
level: medium