title: Password Hint in Emails
id: 34f28f0c-f125-4f6c-8519-d525ef940376
status: experimental
description: Detects emails containing password hints
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    yara_hit: "Phishing_URL_Detection2"
  condition: selection
aggregation:
  timespan: 1h
  count: '> 5'
fields:
  - quarantined_file
falsepositives:
  - Legitimate password reset communications
level: medium
