title: Postfix Failed Authentication Attempts
id: 7c79ab92-c658-4231-8ad7-23d93b5a0036
status: experimental
description: Detects failed SMTP authentication attempts.
logsource:
  product: postfix
  service: smtp
detection:
  keywords:
    - 'warning: SASL LOGIN authentication failed'
  condition: keywords
falsepositives:
  - Legitimate users failing login multiple times
level: medium
tags:
  - attack.credential_access
  - attack.t1110.001
