title: Multiple Email Quarantine Events
id: 7079843a-5902-4905-b255-2c91726aa4b0
status: experimental
description: Detects more than 5 email quarantine events within 1 hour
logsource:
  product: email_security
  service: scanner
detection:
  selection:
    - '*WARNING'
  condition: selection
aggregation:
  timespan: 1h
  count: '> 5'
fields:
  - log_message
falsepositives:
  - Bulk marketing campaigns
  - Phishing simulation exercises
level: critical
